// Операторы сравнения

// console.log(5 >= 10);

//=================================================================

// Приведение(преобразование) типов

// console.log(10 > 5); //TRUE
// console.log('10' > 5); // TRUE CAUSE '10' = Number('10') = 10

// console.log(true > 5); // false cause Number(true) = 1

//================================================================

// Операторы равенства( == и ===) и неравенства(!= и !==)
// "ВСЕГДА ИСПОЛЬЗУЕМ СТРОГОЕ РАВЕНСТВО (===) И НЕРАВЕНСТВО (!==)"

// const isEqual1 = 1 == '1';
// console.log(isEqual1); //true

// const isEqual2 = 1 === '1';
// console.log(isEqual2); // false
